import numpy as np
from sklearn.preprocessing import OneHotEncoder

dict_encode = {
    '年龄': {'青年': 0, '中年': 1, '老年': 2},
    '工作': {'无':   0, '有': 1},
    '住房': {'无':   0, '有': 1},
    '信用': {'一般': 0, '好': 1, '非常好': 2},
    '类别': {'否':   0, '是': 1}
}

feature_name = []
X = [
    ['青年', '否', '否', '一般' ],
    ['青年', '否', '否', '好'   ],
    ['青年', '是', '否', '好'   ],
    ['青年', '是', '是', '一般' ],
    ['青年', '否', '否', '一般' ],
    ['中年', '否', '否', '一般' ],
    ['中年', '否', '否', '好'   ],
    ['中年', '是', '是', '好'   ],
    ['中年', '否', '是', '非常好'],
    ['中年', '否', '是', '非常好'],
    ['老年', '否', '是', '非常好'],
    ['老年', '否', '是', '好'   ],
    ['老年', '是', '否', '好'   ],
    ['老年', '是', '否', '非常好'],
    ['老年', '否', '否', '一般  '],
]

y = [
    '否', '否', '是', '是', '否', '否', '否', '是', '是', '是', '是', '是', '是', '是', '否'
]